{
  "1.0.5": {
    "en": "Update Appstore text and replaced icon for better visibility. Rephrased readme."
  },
  "1.0.4": {
    "en": "Changed wording of eWind Status to Heating/Cooling status and rephrased 'nothing' to 'No heating/cooling'. Replaced icon for better readability."
  },
  "1.0.3": {
    "en": "Further fixes, not need to convert string from string."
  },
  "1.0.2": {
    "en": "Fixed wrong type used to get Status. Changed from Number to String."
  },
  "1.0.1": {
    "en": "Changed 'Current Temperature' to show temperature after heat recovery instead of before heat recovery."
  },
  "1.0.0": {
    "en": "Working modbus support for reading values."
  },
  "1.0.6": {
    "en": "Rebased."
  },
  "1.0.7": {
    "en": "Changed temperature current airtemp to supply_air."
  },
  "1.1.0": {
    "en": "Added Support, Source and Bugs URL. Added more Insights, Fixed a potensial crash, added Ecomode readout, added Ecomode flows."
  },
  "1.1.1": {
    "en": "Added rewrite Ecomode flows. Cleanup of code."
  },
  "1.1.2": {
    "en": "Fixed a fault in calculation of effectivity and updated packages."
  },
  "1.2.0": {
    "en": "Added remaining filter days and status of heating element and heat exchanger."
  },
  "1.2.1": {
    "en": "Added missing capabilities."
  },
  "1.2.2": {
    "en": "Fixed spelling error in capability."
  },
  "1.3.0": {
    "en": "Added alarm for filter alarm and trigger flow card."
  },
  "2.0.0": {
    "en": "Added adjustment of temperature, mode setting, ecomode setting."
  },
  "2.1.0": {
    "en": "Code cleanup, fixed migration/updating of new capabilities for exisiting devices."
  },
  "2.1.1": {
    "en": "Fixed spelling error."
  },
  "2.1.2": {
    "en": "Removed Remaining filter days as that was a static value."
  },
  "2.1.3": {
    "en": "Update packages and removed unnecessary packages, changed polling rate to 1min."
  },
  "2.2.0": {
    "en": "Added action flowcards for Ecomode and Mode."
  },
  "2.2.1": {
    "en": "Updated code."
  },
  "2.2.2": {
    "en": "Turn off boost when mode changes."
  },
  "2.3.0": {
    "en": "Fixed flow cards, added Capability: Last Poll time. Cleanup code and removed some unnecessary logging."
  },
  "2.3.1": {
    "en": "Try to fix capability crash."
  },
  "2.4.0": {
    "en": "Added more delays between sending commands to prevent socket hangup. Try to fix Last poll time to not count when poll is failing."
  },
  "2.4.1": {
    "en": "Remove deprecated capability. Tune delays."
  },
  "2.5.0": {
    "en": "Added TCP keepAlive to keep the Modbus connection always connected (30sec KeepAlive), Removed some more logging, removed delay between requests as KeepAlive solves the problem with Socket Hangup."
  },
  "2.6.0": {
    "en": "Fixed socket problems. Removed ModbusID."
  },
  "2.6.1": {
    "en": "Added OFF-mode to turn the ventilation system off."
  },
  "2.6.2": {
    "en": "Added AutoReconnect if Wifi-connection is unstable or the Modbus module in the ventilation system randomly disconnects."
  },
  "2.7.0": {
    "en": "Translated into Norwegian."
  },
  "2.7.1": {
    "en": "Fixed translation errors."
  },
  "2.7.2": {
    "en": "Fixed lastPollTime to show actually poll time and stop update if Modbus connection quits."
  },
  "2.7.3": {
    "en": "Reduced timeout."
  },
  "2.7.4": {
    "en": "Fixed a bug in target_temperature which forced the modbus-connection to force-close if values were out of range."
  },
  "2.7.5": {
    "en": "Fixed a bug in the new bugfix..."
  },
  "2.7.6": {
    "en": "Added possibility to set target temperature"
  },
  "2.8.0": {
    "en": "Updated and changed some capabilities to work with the new Homey Pro 2023."
  },
  "2.8.1": {
    "en": "Fixed a bug in rewritting to HP23. Measure_temperature should be back on HP now."
  },
  "2.9.0": {
    "en": "Changing modes while polling data should now set the mode after the pull is complete, rewrote some of the code for further optimalization."
  },
  "2.9.1": {
    "en": "Updated dependencies."
  },
  "2.10.0": {
    "en": "Added support for eAir systems."
  },
  "2.10.1": {
    "en": "Bugfix. Typingerror on eAir capability."
  },
  "2.10.2": {
    "en": "Bugfix. Typing error on eAir capability."
  },
  "2.10.3": {
    "en": "Bugfix. Typing error on eAir capability."
  },
  "2.11.0": {
    "en": "Fixing spelling errors on eWind and eAir pairing. Fixed reconnecting if the IP or PORT is changed in Device settings."
  },
  "2.12.0": {
    "en": "Fixed polling to poll when a new state is set. Fixed the mode-changer to jump to previous value until new polling is done. Fixes crash when device is deleted."
  },
  "2.13.0": {
    "en": "Fixed multiple polling-timers going off at the same time."
  }
}
